zephyrproject-rtos/hal_microchip/include/dt-bindings/sam/sam_d5x_e5x/atsamd51/atsamd51g19a-pinctrl.h
/* pa24f_tcc2_wo2 */
#define PA24F_TCC2_WO2 MCHP_PINMUX(a, 24, f, periph)

/* pa24g_pdec_qdi0 */
#define PA24G_PDEC_QDI0 MCHP_PINMUX(a, 24, g, periph)

/* pa24h_usb_dm */
#define PA24H_USB_DM MCHP_PINMUX(a, 24, h, periph)

/* pa24n_ccl_in8 */
#define PA24N_CCL_IN8 MCHP_PINMUX(a, 24, n, periph)

/* pa25_gpio */
#define PA25_GPIO MCHP_PINMUX(a, 25, gpio, gpio)

/* pa25a_eic_extint9 */
#define PA25A_EIC_EXTINT9 MCHP_PINMUX(a, 25, a, periph)

/* pa25c_sercom3_pad3 */
#define PA25C_SERCOM3_PAD3 MCHP_PINMUX(a, 25, c, periph)

/* pa25d_sercom5_pad3 */
#define PA25D_SERCOM5_PAD3 MCHP_PINMUX(a, 25, d, periph)

/* pa25g_pdec_qdi1 */
#define PA25G_PDEC_QDI1 MCHP_PINMUX(a, 25, g, periph)

/* pa25h_usb_dp */
#define PA25H_USB_DP MCHP_PINMUX(a, 25, h, periph)

/* pa25n_ccl_out2 */
#define PA25N_CCL_OUT2 MCHP_PINMUX(a, 25, n, periph)

/* pa27_gpio */
#define PA27_GPIO MCHP_PINMUX(a, 27, gpio, gpio)

/* pa27a_eic_extint11 */
#define PA27A_EIC_EXTINT11 MCHP_PINMUX(a, 27, a, periph)

/* pa27b_adc0_x18 */
#define PA27B_ADC0_X18 MCHP_PINMUX(a, 27, b, periph)

/* pa27b_adc0_y18 */
#define PA27B_ADC0_Y18 MCHP_PINMUX(a, 27, b, periph)

/* pa27m_gclk_io1 */
#define PA27M_GCLK_IO1 MCHP_PINMUX(a, 27, m, periph)

/* pa30_gpio */
#define PA30_GPIO MCHP_PINMUX(a, 30, gpio, gpio)

/* pa30a_eic_extint14 */
#define PA30A_EIC_EXTINT14 MCHP_PINMUX(a, 30, a, periph)

/* pa30b_adc0_x19 */
#define PA30B_ADC0_X19 MCHP_PINMUX(a, 30, b, periph)

/* pa30b_adc0_y19 */
#define PA30B_ADC0_Y19 MCHP_PINMUX(a, 30, b, periph)

/* pa30d_sercom1_pad2 */
#define PA30D_SERCOM1_PAD2 MCHP_PINMUX(a, 30, d, periph)

/* pa30f_tcc2_wo0 */
#define PA30F_TCC2_WO0 MCHP_PINMUX(a, 30, f, periph)

/* pa30m_gclk_io0 */
#define PA30M_GCLK_IO0 MCHP_PINMUX(a, 30, m, periph)

/* pa30n_ccl_in3 */
#define PA30N_CCL_IN3 MCHP_PINMUX(a, 30, n, periph)

/* pa31_gpio */
#define PA31_GPIO MCHP_PINMUX(a, 31, gpio, gpio)

/* pa31a_eic_extint15 */
#define PA31A_EIC_EXTINT15 MCHP_PINMUX(a, 31, a, periph)

/* pa31d_sercom1_pad3 */
#define PA31D_SERCOM1_PAD3 MCHP_PINMUX(a, 31, d, periph)

/* pa31f_tcc2_wo1 */
#define PA31F_TCC2_WO1 MCHP_PINMUX(a, 31, f, periph)

/* pa31n_ccl_out1 */
#define PA31N_CCL_OUT1 MCHP_PINMUX(a, 31, n, periph)

/* pb2_gpio */
#define PB2_GPIO MCHP_PINMUX(b, 2, gpio, gpio)

/* pb2a_eic_extint2 */
#define PB2A_EIC_EXTINT2 MCHP_PINMUX(b, 2, a, periph)

/* pb2b_adc0_ain14 */
#define PB2B_ADC0_AIN14 MCHP_PINMUX(b, 2, b, periph)

/* pb2b_adc0_x20 */
#define PB2B_ADC0_X20 MCHP_PINMUX(b, 2, b, periph)

/* pb2b_adc0_y20 */
#define PB2B_ADC0_Y20 MCHP_PINMUX(b, 2, b, periph)

/* pb2d_sercom5_pad0 */
#define PB2D_SERCOM5_PAD0 MCHP_PINMUX(b, 2, d, periph)

/* pb2f_tcc2_wo2 */
#define PB2F_TCC2_WO2 MCHP_PINMUX(b, 2, f, periph)

/* pb2n_ccl_out0 */
#define PB2N_CCL_OUT0 MCHP_PINMUX(b, 2, n, periph)

/* pb3_gpio */
#define PB3_GPIO MCHP_PINMUX(b, 3, gpio, gpio)

/* pb3a_eic_extint3 */
#define PB3A_EIC_EXTINT3 MCHP_PINMUX(b, 3, a, periph)

/* pb3b_adc0_ain15 */
#define PB3B_ADC0_AIN15 MCHP_PINMUX(b, 3, b, periph)

/* pb3b_adc0_x21 */
#define PB3B_ADC0_X21 MCHP_PINMUX(b, 3, b, periph)

/* pb3b_adc0_y21 */
#define PB3B_ADC0_Y21 MCHP_PINMUX(b, 3, b, periph)

/* pb3d_sercom5_pad1 */
#define PB3D_SERCOM5_PAD1 MCHP_PINMUX(b, 3, d, periph)

/* pb8_gpio */
#define PB8_GPIO MCHP_PINMUX(b, 8, gpio, gpio)

/* pb8a_eic_extint8 */
#define PB8A_EIC_EXTINT8 MCHP_PINMUX(b, 8, a, periph)

/* pb8b_adc0_ain2 */
#define PB8B_ADC0_AIN2 MCHP_PINMUX(b, 8, b, periph)

/* pb8b_adc0_x1 */
#define PB8B_ADC0_X1 MCHP_PINMUX(b, 8, b, periph)

/* pb8b_adc0_y1 */
#define PB8B_ADC0_Y1 MCHP_PINMUX(b, 8, b, periph)

/* pb8b_adc1_ain0 */
#define PB8B_ADC1_AIN0 MCHP_PINMUX(b, 8, b, periph)

/* pb8d_sercom4_pad0 */
#define PB8D_SERCOM4_PAD0 MCHP_PINMUX(b, 8, d, periph)

/* pb8n_ccl_in8 */
#define PB8N_CCL_IN8 MCHP_PINMUX(b, 8, n, periph)

/* pb9_gpio */
#define PB9_GPIO MCHP_PINMUX(b, 9, gpio, gpio)

/* pb9a_eic_extint9 */
#define PB9A_EIC_EXTINT9 MCHP_PINMUX(b, 9, a, periph)

/* pb9b_adc0_ain3 */
#define PB9B_ADC0_AIN3 MCHP_PINMUX(b, 9, b, periph)

/* pb9b_adc0_x2 */
#define PB9B_ADC0_X2 MCHP_PINMUX(b, 9, b, periph)

/* pb9b_adc0_y2 */
#define PB9B_ADC0_Y2 MCHP_PINMUX(b, 9, b, periph)

/* pb9b_adc1_ain1 */
#define PB9B_ADC1_AIN1 MCHP_PINMUX(b, 9, b, periph)

/* pb9d_sercom4_pad1 */
#define PB9D_SERCOM4_PAD1 MCHP_PINMUX(b, 9, d, periph)

/* pb9n_ccl_out2 */
#define PB9N_CCL_OUT2 MCHP_PINMUX(b, 9, n, periph)

/* pb10_gpio */
#define PB10_GPIO MCHP_PINMUX(b, 10, gpio, gpio)

/* pb10a_eic_extint10 */
#define PB10A_EIC_EXTINT10 MCHP_PINMUX(b, 10, a, periph)

/* pb10d_sercom4_pad2 */
#define PB10D_SERCOM4_PAD2 MCHP_PINMUX(b, 10, d, periph)

/* pb10f_tcc0_wo4 */
#define PB10F_TCC0_WO4 MCHP_PINMUX(b, 10, f, periph)

/* pb10g_tcc1_wo0 */
#define PB10G_TCC1_WO0 MCHP_PINMUX(b, 10, g, periph)

/* pb10h_qspi_sck */
#define PB10H_QSPI_SCK MCHP_PINMUX(b, 10, h, periph)

/* pb10i_sdhc0_sddat3 */
#define PB10I_SDHC0_SDDAT3 MCHP_PINMUX(b, 10, i, periph)

/* pb10m_gclk_io4 */
#define PB10M_GCLK_IO4 MCHP_PINMUX(b, 10, m, periph)

/* pb10n_ccl_in11 */
#define PB10N_CCL_IN11 MCHP_PINMUX(b, 10, n, periph)

/* pb11_gpio */
#define PB11_GPIO MCHP_PINMUX(b, 11, gpio, gpio)

/* pb11a_eic_extint11 */
#define PB11A_EIC_EXTINT11 MCHP_PINMUX(b, 11, a, periph)

/* pb11d_sercom4_pad3 */
#define PB11D_SERCOM4_PAD3 MCHP_PINMUX(b, 11, d, periph)

/* pb11f_tcc0_wo5 */
#define PB11F_TCC0_WO5 MCHP_PINMUX(b, 11, f, periph)

/* pb11g_tcc1_wo1 */
#define PB11G_TCC1_WO1 MCHP_PINMUX(b, 11, g, periph)

/* pb11h_qspi_cs */
#define PB11H_QSPI_CS MCHP_PINMUX(b, 11, h, periph)

/* pb11i_sdhc0_sdck */
#define PB11I_SDHC0_SDCK MCHP_PINMUX(b, 11, i, periph)

/* pb11m_gclk_io5 */
#define PB11M_GCLK_IO5 MCHP_PINMUX(b, 11, m, periph)

/* pb11n_ccl_out1 */
#define PB11N_CCL_OUT1 MCHP_PINMUX(b, 11, n, periph)

/* pb22_gpio */
#define PB22_GPIO MCHP_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 MCHP_PINMUX(b, 22, a, periph)

/* pb22c_sercom1_pad2 */
#define PB22C_SERCOM1_PAD2 MCHP_PINMUX(b, 22, c, periph)

/* pb22d_sercom5_pad2 */
#define PB22D_SERCOM5_PAD2 MCHP_PINMUX(b, 22, d, periph)

/* pb22g_pdec_qdi2 */
#define PB22G_PDEC_QDI2 MCHP_PINMUX(b, 22, g, periph)

/* pb22h_usb_sof_1khz */
#define PB22H_USB_SOF_1KHZ MCHP_PINMUX(b, 22, h, periph)

/* pb22m_gclk_io0 */
#define PB22M_GCLK_IO0 MCHP_PINMUX(b, 22, m, periph)

/* pb22n_ccl_in0 */
#define PB22N_CCL_IN0 MCHP_PINMUX(b, 22, n, periph)

/* pb23_gpio */
#define PB23_GPIO MCHP_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 MCHP_PINMUX(b, 23, a, periph)

/* pb23c_sercom1_pad3 */
#define PB23C_SERCOM1_PAD3 MCHP_PINMUX(b, 23, c, periph)

/* pb23d_sercom5_pad3 */
#define PB23D_SERCOM5_PAD3 MCHP_PINMUX(b, 23, d, periph)

/* pb23g_pdec_qdi0 */
#define PB23G_PDEC_QDI0 MCHP_PINMUX(b, 23, g, periph)

/* pb23m_gclk_io1 */
#define PB23M_GCLK_IO1 MCHP_PINMUX(b, 23, m, periph)

/* pb23n_ccl_out0 */
#define PB23N_CCL_OUT0 MCHP_PINMUX(b, 23, n, periph)

#endif /* MICROCHIP_ATSAMD51G19A_PINCTRL_H_ */
